app/Http/Controllers/apiAuthController.php

select * from `users` where `firebase_uid` = 'u38Z9F4pRIVeTebe4ZGlsMicn3w2' limit 1
---
    public function login(Request $request){

        $request->validate([
            'firebase_token'=>'required|string',
            'phone_number'=>'required|numeric',
            'password'=>'required|string'
        ]);
  $auth = app('firebase.auth');
  $idTokenString = $request->input('firebase_token');
  try { // Try to verify the Firebase credential token with Google
    $verifiedIdToken = $auth->verifyIdToken($idTokenString);
  } catch (\InvalidArgumentException $e) { // If the token has the wrong format
    return response()->json([
        'message' => 'Unauthorized - Can\'t parse the token: ' . $e->getMessage()
    ], 401);
  } catch (InvalidToken $e) { // If the token is invalid (expired ...)
    return response()->json([
        'message' => 'Unauthorized - Token is invalide: ' . $e->getMessage()
    ], 401);
  }
  $uid = $verifiedIdToken->getClaim('sub');
  if(User::where('firebase_uid',$uid)->first())