app/Http/Controllers/BuddhistController.php

    public function index()
    {

        $bud = Buddhist::where([['end_time', '>', Carbon::now()], ["active", "1"]])->with('type')->orderBy("created_at", "desc")->get();
---
select * from `types` where `types`.`id` in (1)

            $fileExtension = $image->getClientOriginalExtension();
            $fileName = 'buddhist' . \uniqid() . "_" . time() . '.' . $fileExtension;
            $location = public_path("/buddhist_images/" . $folderName . "/" . $fileName);
            Image::make($image)->resize(800, null, function ($constraint) {$constraint->aspectRatio();})->save($location);
---
insert into `buddhists` (`name`, `detail`, `price`, `start_time`, `end_time`, `highest_price`, `pay_choice`, `sending_choice`, `place`, `status`, `priceSmallest`, `bank_name`, `account_name`, `account_number`, `place_send`, `tel`, `more_info`, `image_path`, `user_id`, `type_id`, `highBidUser`, `updated_at`, `created_at`) values ('ພະເບີ້ມໆ8', 'ພະດີມີຄຸນນະພາບ', '15000', '2021-05-10 14:06:46', '2021-05-20 00:00:00', '15000', '1', '1', 'ບ້ານໜອງພະຍາ', 'ໃຫມ່', '5000', 'v_bank', 'v_account', '555555555555', 'ບ້ານໜອງພະຍາ', '8562052416369', 'ມີຕຳນີໜ້ອຍດຽວ', '6098db86452da_1620630406', 2, '1', 2, '2021-05-10 14:06:46', '2021-05-10 14:06:46')

    public function show($id)
    {

        $bud = Buddhist::where('id', $id)->with(["type", "user"])->first();
---
select * from `buddhists` where `id` = '8' limit 1
select * from `types` where `types`.`id` in (1)
select * from `users` where `users`.`id` in (2)