app/Http/Controllers/CommentController.php

    public function store(Request $request)
    {
        $request->validate([
            'message' => 'required|string|max:255',
            'fcm_token' => 'required|string',
            'buddhist_id' => 'required|string',
        ]);
        try {
            $database = app('firebase.database');
            $messaging = app('firebase.messaging');
            $result = $messaging->validateRegistrationTokens($request->fcm_token);
            if ($result['invalid'] != null) {
                return response()->json(['data' => 'your json token is invalid'], 404);

            }
            // search data
            $reference = $database->getReference('Comments/' . $request->buddhist_id . '/')
                ->orderByChild("uid")
                ->equalTo(Auth::user()->firebase_uid)
                ->limitToFirst(1)
                ->getSnapshot();
---
select * from `comments` where (`user_id` = 3 and `buddhist_id` = '11') limit 1