app/Http/Controllers/FavouriteController.php

select * from `buddhists` where `buddhists`.`id` in (4, 8)
---
    public function index()
    {
        /* $favorite = favourite::where(
        'user_id', Auth::id()
        )->with('buddhist')->orderBy("created_at", "desc")->get();*/