app/Http/Controllers/notificationController.php

    public function biddingNotification()
    {

        $data = NotificationFirebase::where([
            ["user_id", Auth::id()],
            ["notification_type", "bidding"],
        ])->orderBy("created_at", "desc")->get();
        if (empty($data)) {
            return response()->json([
                "message" => "no notification",
            ]);
        }
        NotificationFirebase::where([
            ["user_id", Auth::id()],
            ["read", "0"],
        ])->update([
            'read' => 1,
        ]);
---
update `notification` set `read` = 1, `notification`.`updated_at` = '2021-05-11 00:09:03' where `user_id` = 3