app/Models/User.php

select * from `users` where `phone_number` = '+8562059880655' limit 1
---
    public function findForPassport($phone_number)
    {
        //return $this->where('phone_number', $phone_number)->first();
        if(filter_var($phone_number, FILTER_VALIDATE_EMAIL)){
         return  $this->where('email_address', $phone_number)->first();
        }
        else if(is_numeric($phone_number)){
            return $this->where('phone_number', $phone_number)->first();